# Напишите программу которая принимает любое число 
# если число четное,то программа должна сказать ,
# что это число четное если нет, то сказать ,что оно
# нечетное


a = int(input())

if a % 2 == 0:
    print('Chislo chetnoe')

else:
    print('Nechetnoe ')